<?xml version='1.0' encoding="UTF-8" ?>

<sect1 id='gimp-tool-crop'>
  <title lang="en">Crop Tool</title>
  <title lang="de">Zuschneiden Werkzeug</title>
  <title lang="fr">Outil D&eacute;couper et Redimensionner</title>
  <indexterm lang="en">
    <primary>Toolbox</primary>
    <secondary>Crop</secondary>
    <tertiary>Clip</tertiary>
  </indexterm>
  <indexterm lang="de">
    <primary>Werkzeugfenster</primary>
    <secondary>Zuschneiden</secondary>
    <tertiary>Skalpell</tertiary>
  </indexterm>
  <indexterm lang="fr">
    <primary>Bo&icirc;te &agrave; outils</primary>
    <secondary>D&eacute;couper et redimensionner</secondary>
    <tertiary>Cutter</tertiary>
  </indexterm>

  <mediaobjectco lang="en">
    <imageobject>
      <imagedata fileref='../images/toolbox/toolbox-crop.png' format='png'/>
    </imageobject>
  </mediaobjectco>
  <mediaobjectco lang="de">
    <imageobject>
      <imagedata fileref='../images/toolbox/de/toolbox-crop.png' format='png'/>
    </imageobject>
  </mediaobjectco>
  
  <para lang="en">
    The Crop Tool is used to crop or clip an image or layer. This tool is most
    used to remove borders, or to eliminate unwanted areas to provide you with
    a more focussed working area. It is also useful when wanting specific image
    sizes such as for desktop wallpapers.
  </para>

  <para lang="de">
    Das Zuschneiden Werkzeug wird benutzt um das Bild zurecht zu schneiden.
    Anwendung findet es, um Rahmen (engl. "Border") oder nicht
    ben&ouml;tigte Bereiche zu entfernen. Auch um das Bild auf spezifische
    Bildgr&ouml;ssen zu trimmen, kann das Werkzeug sehr hilfreich sein.
  </para>

  <para lang="fr">
    Cet outil sert &agrave; d&eacute;couper un calque ou une image. Il est 
    surtout utilis&eacute; pour &eacute;liminer les bordures et pour supprimer 
    des surfaces non d&eacute;sir&eacute;es, de fa&ccedil;on &agrave; vous 
    fournir une surface de travail mieux cibl&eacute;e. Il est &eacute;galement 
    utile quand vous voulez une taille pr&eacute;cise comme pour les papiers 
    peints.
  </para>
  <para lang= "fr">
    Quand vous d&eacute;placez le curseur sur l'image, un cadre de
    s&eacute;lection se d&eacute;veloppe: c'est la partie de l'image qui
    sera conserv&eacute;e.  Les coins en haut &agrave; gauche et en bas
    &agrave; droite permettent de modifier la taille du cadre. Les coins en
    haut &agrave; droite et en bas &agrave; gauche permettent de
    d&eacute;placer le cadre.
  </para>
  
  <simplesect>
    <title lang="en">Tool call</title>
    <title lang="de">Werkzeugaufruf</title>
    <itemizedlist lang="en">
      <listitem>
        <para>
          The Crop Tool can be called in the following
          order, from the image-menu:
          <guimenuitem><accel>T</accel>ools</guimenuitem>/
          <guimenuitem><accel>T</accel>ransform Tools
            </guimenuitem>/<guimenuitem><accel>C</accel>rop &amp; Resize
          </guimenuitem>. 
        </para>
      </listitem>
      <listitem>
        <para>
          The Tool can also be called by clicking the tool icon:
          <guiicon>
            <inlinegraphic
              fileref='../images/toolbox/crop.png'></inlinegraphic>
          </guiicon>
        </para>
      </listitem>
    </itemizedlist>
    <itemizedlist lang="de">
      <listitem>
        <para>
          Die rechteckige Auswahl l&auml;sst sich &uuml;ber das
          Bildmen&uuml; aufrufen: <guimenuitem><accel>W</accel>erkzeuge
            </guimenuitem>/<guimenuitem><accel>T</accel>ransformationen
            </guimenuitem>/<guimenuitem><accel>Z</accel>uschneiden bzw.
            Gr&ouml;&szlig;e &auml;ndern</guimenuitem>.
        </para>
      </listitem>
      <listitem>
        <para>
          Ebenfalls kann das Werkzeug &uuml;ber einen Mausklick auf das
          Werkzeugicon aufgerufen werden:
          <guiicon>
            <inlinegraphic
              fileref='../images/toolbox/crop.png'></inlinegraphic>
          </guiicon>
        </para>
      </listitem>
    </itemizedlist>
  </simplesect> 
  
  <simplesect>
     <title lang="en">Key modifiers (Defaults)</title>
      <title lang="de">Tastaturbindungen (Standardeinstellunge)</title>
      <title lang="fr">Touches de modification (Par d&eacute;faut)</title>
      <variablelist>
        <varlistentry>
          <term lang="en">Shortcut</term>
          <term lang="de">Tastaturk&uuml;rzel</term>
          <term lang="fr">Raccourcis clavier</term>
        <listitem>
          <para lang="en">
            The
            <keycombo>
              <keycap>Shift</keycap>
              <keycap>c</keycap>
            </keycombo>
            shortcut will change the active tool to the Crop Tool.
          </para>
          <para lang="de">
            Die Tastenkombination
            <keycombo>
              <keycap>Shift</keycap>
              <keycap>c</keycap>
            </keycombo>
            ruft das Zuschneiden Werkzeug auf.
          </para>
          <para lang="fr">
            Le raccourci
            <keycombo>
              <keycap>Maj</keycap>
              <keycap>c</keycap>
            </keycombo>
            Changera l'outil actif en D&eacute;couper et Redimensionner.
          </para>
        </listitem>
      </varlistentry>
      <varlistentry>
        <term lang="en"><keycap>Ctrl</keycap></term>
        <term lang="de"><keycap>Strg</keycap></term>
        <term lang="fr"><keycap>Ctrl</keycap></term>
        <listitem>
          <para lang="en">
            Holding <keycap>Ctrl</keycap> will switch the Crop Tool mode
            between Crop and Resize.
          </para>
          <para lang="de">
            Duch gedr&uuml;ckt Halten der Taste <keycap>Strg</keycap> wird
            zwischen den zwei Werkzeug-Modi, Zuschneiden oder
            Gr&ouml;&szlig;e &auml;ndern, gewechselt. 
          </para>
          <para lang="fr">
            En maintenant <keycap>Ctrl</keycap> enfonc&eacute;e, le mode 
            basculera entre le mode D&eacute;couper et le mode Redimensionner.
          </para>
        </listitem>
      </varlistentry>
      <varlistentry><term><keycap>Alt</keycap></term>
        <listitem>
          <para lang="en">
            Holding <keycap>Alt</keycap> will toggle the use of Allow
            Enlarging.
          </para>
          <para lang="de">
            Durch gedr&uuml;ckt Halten der <keycap>Alt</keycap>-Taste wird
            die Option <guilabel>Vergr&ouml;&szlig;ern zulassen</guilabel>
            aktiviert.
          </para>
          <para lang="fr">
            En maintenant la touche <keycap>Alt</keycap> enfonc&eacute;e, on
            bascule la fonction Permet d'&eacute;largir.
          </para>
        </listitem>
      </varlistentry>
    </variablelist>
  </simplesect>
  <simplesect>
  <variablelist>
    <title lang="en">Options</title>
    <title lang="de">Optionen</title>
    <title lang="fr">Options</title>
    <varlistentry>
      <term lang="en">Overview</term>
      <term lang="de">Aufruf</term>
      <term lang="fr">Vue d'ensemble</term>
      <listitem>
        <para lang="en">
          The available tool options for Fuzzy Select can be accessed by
          double clicking the Fuzzy Select tool icon.<guiicon>
            <inlinegraphic fileref='../images/toolbox/crop.png'>
          </inlinegraphic></guiicon>
        </para>
        <para lang="de">
          Die Werkzeugeinstellungen f&uuml;r das Zuschneiden Werkzeug
          lassen sich durch ein Doppelklick auf das Icon <guiicon>
            <inlinegraphic fileref='../images/toolbox/crop.png'>
          </inlinegraphic></guiicon>anzeigen.
        </para>
        <para lang="fr">
          Les options disponibles pour cet outil peuvent &ecirc;tre obtenues 
          par un double clic sur l'ic&ocirc;ne d'outil <guiicon>
            <inlinegraphic fileref='../images/toolbox/crop.png'>
          </inlinegraphic></guiicon>
        </para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term lang="en">Tool Toggle</term>
      <term lang="de">Werkzeug-Modus</term>
      <term lang="fr">Moduler l'outil</term>
      <listitem>
        <para lang="en">
          The Tool Toggle for the Crop Tool alternates between
          <guilabel>Crop mode</guilabel> and <guilabel>Resize
            mode</guilabel>.
        </para>
        <para lang="en">
          Crop Mode is the standard mode of operation for the Crop Tool.
          Cropping an image or layer will change a layer by eliminating
          everything outside the cropping area. The cropping area can be
          set by either dragging the tool to form a rectangle area or
          manually setting the origin, width, and height. Cropping areas
          can also be set based on an existing selection or by using the
          Auto Shrink button.  These options are available within the Crop
          And Resize Information dialog which is shown when the Crop Tool
          is clicked on an image or layer.
        </para>
        <para lang="en">
          Resize Mode works in a similar fashion to Crop Mode with the
          exception that the layer or layers affected by the cropping are
          not changed in size. That is to say that the layer size remains
          as it is, but the pixel information outside the cropping region
          is removed.
        </para>

        <para lang="de">
          Der Werkzeug-Modus f&uuml;r das Zuschneiden Werkzeug kann
          entweder auf <guilabel>Zuschneiden</guilabel> oder
          <guilabel>Gr&ouml;&szlig;e &auml;ndern</guilabel> eingestellt
          werden.
        </para>
        <para lang="de">
          Standardm&auml;ssig ist das Werkzeug auf den Zuschneiden Modus
          eingestellt. Der Bereich, auf den zugeschnitten werden soll, kann
          entweder durch Ziehen einer rechteckigen (Zuschneide-)Auswahl
          oder durch manuelles Spezifieren der H&ouml;hen- und
          Breitenangaben, erfolgen. Bei der Benutzung des Werkzeuges wird
          automatisch ein Dialogfenster eingeblendet. So bietet dies
          zus&auml;tzliche Einstellungsm&ouml;glichkeiten, die die
          Benutzung des Werkzeuges erleichtern soll. 
        </para>

        <para lang="de">
          Der <guilabel>Gr&ouml;&szlig;e &auml;ndern</guilabel>-Modus
          funktioniert &auml;hnlich dem Zuschneide Modus, aber mit dem
          Unterschied, dass die Gr&ouml;sse der betroffenen Ebenen nicht
          ver&auml;ndert wird. So bleibt die Gr&ouml;sse der Ebene erhalten
          und nur die Pixel um den Zuschneide Bereich werden entfernt.
        </para>
        
        <para lang="de"> 
          Zuschneidebereiche k&ouml;nnen auch aus einer vorhandenen
          rechteckigen Auswahl erstellt werden. Ist der ausgew&auml;hlte
          Bereich zu ungenau oder zu gross, steht noch die Option aus dem
          Dialogfenster zur Verf&uuml;gung, den Zuschneidebereich
          automatisch verkleinern zu lassen.  
        </para>     

        <para lang="fr">
          Moduler l'outil permet de passer du <guilabel>Mode D&eacute;couper 
          les bords</guilabel> au <guilabel>Mode Redimensionner</guilabel>.
        </para>
        <para lang="fr">
          Le mode D&eacute;couper est le mode op&eacute;ratoire standard
          pour cet outil. Le fait de d&eacute;couper une image ou un calque
          &eacute;limine tout ce qui est en dehors de l'aire
          d&eacute;coup&eacute;e.  L'aire d&eacute;coup&eacute;e peut
          &ecirc;tre d&eacute;finie soit en s&eacute;lectionnant un
          rectangle avec la souris, soit en fixant manuellement l'origine,
          la largeur et la hauteur. Les aires de d&eacute;coupage peuvent
          aussi &ecirc;tre bas&eacute;es sur une s&eacute;lection ou en
          utilisant le bouton R&eacute;duction Automatique.  Ces options
          sont disponibles dans la bo&icirc;te d'information
          D&eacute;couper et Redimensionner qui appara&icirc;t quand
          l'outil est cliqu&eacute; sur une image ou un calque.
        </para>
        <para lang="fr">
          Le mode Redimensionner fonctionne de la m&ecirc;me fa&ccedil;on
          que le mode D&eacute;couper, sauf que le ou les calques
          affect&eacute;s par le d&eacute;coupage ne changent pas de
          taille. C'est-&agrave;-dire que la taille du calque reste
          inchang&eacute;e tandis que l'information en dehors de la zone
          d&eacute;coup&eacute;e est supprim&eacute;e.
        </para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term lang="en">Current Layer Only</term>
      <term lang="de">Nur die aktive Ebene</term>
      <term lang="fr">Calque courant seulement</term>
      <listitem>
        <para lang="en">
          This option will make the crop or resize affect only the active
          layer.
        </para>
        <para lang="de">
          Das Zuschneiden findet nur auf der aktiven Ebene Anwendung.
          Andere Ebenen werden nicht durch das Werkzeug ver&auml;ndert.
        </para>
        <para lang="fr">
          Avec cette option, l'effet D&eacute;couper et Redimensionner ne
          s'appliquera qu'au calque actif.
        </para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term lang="en">Allow Enlarging</term>
      <term lang="de">Vergr&ouml;&szlig;ern zulassen</term>
      <term lang="fr">Permet d'&eacute;largir</term>
      <listitem>
        <para lang="en">
          This option allows the crop or resize to take place outside the image
          or layer boundary.
        </para>
        <para lang="de">
          Diese Option erlaubt es, Gr&ouml;ssen&auml;nderungen ausserhalb
          des Zuschneidebereiches zuzulassen.
        </para>
        <para lang="fr">
          Cette option permet &agrave; l'outil D&eacute;couper et
          Redimensionner d'agir en dehors des limites du calque ou de
          l'image.
        </para>
      </listitem>
    </varlistentry>
  </variablelist>

  <variablelist>
    <title lang="en">Crop And Resize Information</title>
    <title lang="de">Zuschneideinformationen</title>
    <title lang="fr">Informations D&eacute;couper et Redimensionner</title>
    <varlistentry>
      <term lang="en">Origin</term>
      <term lang="de">Ursprung</term>
      <term lang="fr">Origine</term>
      <listitem>
        <para lang="en">
          The Origin selectors allow the manual setting of the top left corner
          of the cropping region. The units may also be chosen.
        </para>
        <para lang="de">
          Die Eingabefelder f&uuml;r den <guilabel>Ursprung</guilabel>
          dienen der manuellen Spezifizierung des Ursprunges f&uuml;r den
          zuzuschneidenen Bereich. Der Ursprung ist immer die linke, obere
          Ecke des Zuschneidebereiches. Zus&auml;tzlich k&ouml;nnen noch
          Einheiten f&uuml;r die Bereichsangaben ausgew&auml;hlt werden.
        </para>
        <para lang="fr">
          Les s&eacute;lecteurs d'Origine permettent la d&eacute;finition
          manuelle du coin en haut &agrave; gauche de la zone &agrave;
          d&eacute;couper.  On peut &eacute;galement choisir l'unit&eacute;
          de mesure.
        </para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term lang="en">Width/Height</term>
      <term lang="de">Breite/H&ouml;he</term>
      <term lang="fr">Largeur/Hauteur</term>
      <listitem>
        <para lang="en">
          The Width and Height selectors allow the manual setting of both the
          width and the height of the cropping area. The units may also be
          chosen.
        </para>
        <para lang="de">
          H&ouml;hen- und Breitenangaben des Zuschneidebereiches
          k&ouml;nnen hier manuell eingegeben werden. Zus&auml;tzlich
          stehen noch Einheiten f&uuml;r die Werte zu Auswahl.
        </para>
        <para lang="fr">
          Les s&eacute;lecteurs Largeur et Hauteur permettent de choisir 
          manuellement la largeur et la hauteur de l'aire de d&eacute;coupage. 
          On peut aussi choisir l'unit&eacute; de mesure.
        </para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term lang="en">From Selection</term>
      <term lang="de">Aus Auswahl</term>
      <term lang="fr">D'apr&egrave;s la  S&eacute;lection</term>
      <listitem>
        <para lang="en">
          This button will resize the cropping area to encompass all active
          selections contained within the image.
        </para>
        <para lang="de">
          Diese Schaltfl&auml;che passt die Gr&ouml;sse des
          Zuschneidebereiches an die Gr&ouml;sse der bestehenden Auswahl
          an.
        </para>
        <para lang="fr">
          Ce bouton ajuste la taille de l'aire de d&eacute;coupage pour
          qu'elle englobe toutes les s&eacute;lections actives dans
          l'image.  S'il n'y a pas de s&eacute;lection, la taille est
          &eacute;tendue &agrave; toute l'image.
        </para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term lang="en">Auto Shrink</term>
      <term lang="de">Automatisch Schrumpfen</term>
      <term lang="fr">R&eacute;duction Automatique</term>
      <listitem>
        <para lang="en">
          The Auto Shrink button will attempt to locate a border from which to
          draw dimensions from.
        </para>
        <para lang="de">
          Die Schaltfl&auml;che <guibutton>Automatisch Schrumpfen</guibutton>
          versucht automatisch den Zuschneidebereich an ein bestehendes
          Bildobjekt anzupassen.
        </para>
        <para lang="fr">
          Le bouton R&eacute;duction Automatique essaiera de trouver une
          limite pour fixer les dimensions de l'aire de d&eacute;coupage.
          Il r&eacute;tr&eacute;cit une zone s&eacute;lection
          jusqu'&agrave; ce que les couleurs de part et d'autre de la
          limite soient diff&eacute;rentes.
        </para>
      </listitem>
    </varlistentry>
  </variablelist>
</simplesect>
</sect1>
