<?xml version='1.0' encoding="UTF-8" ?>

<sect1 id='gimp-tool-curves'>
  <title lang="en">Curves Tool</title>
  <title lang="fr">Outil Courbes</title>

  <para lang="en">
    The Curves tool is the most sophisticated tool used to adjust the 
    tonality of images. From the Image window it is located in Tools > Color Tools...
  </para>
  <para lang="fr">
    L'outil Courbes est le plus sophistiqu&eacute; des outils 
    utilis&eacute;s pour modifier la tonalit&eacute; des images. Depuis la fen&ecirc;tre
    d'image il se trouve dans Outils > Outils Couleurs...
  </para>

  <variablelist>
    <title lang="en">Options</title>
    <title lang="fr">Options</title>

    <varlistentry>
      <term lang="en">Modify Curves for Channel</term>
      <term lang="fr">Modifier les Courbes pour le canal</term>
      <listitem>
        <para lang="en">
          There are five options: Value for luminosity and contraste, Red, Green and Blue for saturation and Alpha.
        </para>
        <para lang="en">
          <guilabel>Initialize</guilabel> button deletes all changes made to 
          the selected channel.
        </para>

        <para lang="fr">
          Vous disposez l&agrave; de Valeur pour la luminosit&eacute; et le contraste de l'image, de chacun des trois canaux Rouge, Vert, Bleu pour le r&eacute;glage de la saturation et du canal Alpha pour la transparence.
        </para>
        <para lang="fr">
          Le bouton <guilabel>Initialiser</guilabel> annule tous les 
          changements apport&eacute;s au canal choisi.
        </para>
      </listitem>
    </varlistentry>

    <varlistentry>
      <term lang="en">Main Editing Area</term>
      <term lang="fr">Aire d'Edition</term>
      <listitem>
        <para lang="en">
          <guilabel>Input and Output Value Domains</guilabel>: The horizontal bar (x-axis) represents input 
          values (they are value levels from  0 to 255). The vertical bar (y-axis) is only a scale for 
          output colors of the selected channel.
        </para>
        <para lang="en">
          <guilabel>The control curve</guilabel> is drawn on a grid and goes from bottom left corner to 
          top right corner. Pointer x/y position is permanently displayed in top left part of the grid. 
          If you click on the curve, a <guilabel>Control point</guilabel> is created. You can move it to 
          bend the curve. If you click outside of the curve, a control point is also created, and the curve 
          includes it automatically.
        </para>
        <para lang="en">
          So, each point of the curve represents an 'x' level, corresponding to an 'y' color. If, for 
          example, you move a curve segment to the right, i.e to highlights, you can see that these 
          highlights are corresponding to darker output tones and that image pixels corresponding to this 
          curve segment will go darker. With color channels, moving right will decrease saturation ans can reach the complementary color.
        </para>
        <para lang="en">
          To delete all control points (apart from both ends), click on the 'Initialize Channel' 
          button. To delete only one point, move it onto another point or to grid border.
        </para>

        <para lang="fr">
          <guilabel>Les barres de valeurs</guilabel>: La barre horizontale 
          (axe des x) concerne les valeurs d'entr&eacute;e: ce sont les 
          niveaux de valeur de 0 &agrave; 255. La barre verticale (axe des y) 
          est une simple &eacute;chelle repr&eacute;sentant les couleurs de 
          sortie du canal choisi.
        </para>
        <para lang="fr">
          <guilabel>La courbe de contr&ocirc;le</guilabel>: Elle est 
          dessin&eacute;e sur une grille et va du coin inf&eacute;rieur
          gauche au coin sup&eacute;rieur droit. La position x, y du pointeur 
          est affich&eacute;e en permanence en haut &agrave; gauche de la 
          grille. Si vous cliquez sur la courbe, un <guilabel>point de 
          contr&ocirc;le</guilabel> est cr&eacute;&eacute;, que vous pouvez 
          d&eacute;placer pour d&eacute;former la courbe. Si vous cliquez en 
          dehors de la courbe, un point de contr&ocirc;le est &eacute;galement 
          cr&eacute;&eacute;, et la courbe vient l'englober automatiquement.
        </para>
        <para lang="fr">
          Chaque point de la courbe repr&eacute;sente donc un niveau x, 
          correspondant &agrave; une couleur y. Si, par exemple, vous 
          d&eacute;placez un segment de courbe vers la droite, donc vers les 
          tons clairs, vous voyez que ces tons clairs correspondront &agrave; 
          des tons de sortie plus fonc&eacute;s et que les pixels de l'image
          correspondant au segment de courbe d&eacute;plac&eacute; seront
          assombris. Avec les canaux de couleur, le d&eacute;calage vers la droite diminue la saturation ce qui peut aller jusqu'&agrave; faire appara&icirc;tre la couleur compl&eacute;mentaire
        </para>
        <para lang="fr">
          Pour supprimer tous les points de contr&ocirc;le (sauf ceux des 
          extr&ecirc;mit&eacute;s qui sont permanents), cliquez sur le bouton
          'Initialiser le canal'. Pour supprimer un seul point, faites-le 
          glisser sur un autre point ou sur un bord de la grille.
        </para>
      </listitem>
    </varlistentry>

    <varlistentry>
      <term lang="en">All Channels</term>
      <term lang="fr">Tous les canaux</term>
      <listitem>  
        <para lang="en">
          <guilabel>Load</guilabel>: This button allows to select a file 
          holding curve settings.
        </para> 
        <para lang="en">
          <guilabel>Save</guilabel>: Allows to save any curves you have set 
          to a file that can be loaded later.
        </para>

        <para lang="fr">
          <guilabel>Ouvrir</guilabel>: Permet de choisir et de charger un 
          fichier contenant les param&egrave;tres de r&eacute;glage.
        </para>
        <para lang="fr">
          <guilabel>Enregistrer</guilabel>: Enregistre les param&egrave;tres 
          de r&eacute;glage de la courbe dans un fichier, que vous pourrez 
          charger plus tard.
        </para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term lang="en">Curve Type</term>
      <term lang="fr">Type de courbe</term>
      <listitem>
        <para lang="en">
          <guilabel>Smooth</guilabel>: This mode constrains the curve type 
          to a smooth line with tension. It provides a more realistic 
          render than the following.
        </para>
        <para lang="en">
          <guilabel>Free</guilabel> You can draw your curve free-hand with 
          the mouse. With curve segments scattered all over the grid, 
          result will be surprising, but poorly repeatable.
        </para>
         <para lang="fr">
          <guilabel>Courbe liss&eacute;e</guilabel>: La courbe est d&eacute;finie
          par des points de contr&ocirc;le et elle se dessine automatiquement en douceur.
          Ce mode est plus proche de la r&eacute;alit&eacute; que le suivant.
        </para>
        <para lang="fr"> 
          <guilabel>A main lev&eacute;e</guilabel>: Vous pouvez dessiner 
          librement votre courbe avec la souris. Rien ne vous emp&ecirc;che 
          d'&eacute;parpiller des segments de courbe sur la grille: le 
          r&eacute;sultat sera surprenant, mais peu reproductible.
        </para>
      </listitem>
    </varlistentry>

    <varlistentry>
      <term lang="en">Preview</term>
      <term lang="fr">Aper&ccedil;u</term>
      <listitem>
        <para lang="en">
          The Preview button makes all changes to the levels dynamically so 
          that the new level settings can be viewed straight away.
        </para>
        <para lang="fr">
          Quand cette option est coch&eacute;e, les changements 
          apport&eacute;s &agrave; la courbe apparaissent dans l'image 
          d&egrave;s que vous rel&acirc;chez le bouton de la souris.
        </para>
      </listitem>
    </varlistentry>
  </variablelist>     

</sect1>
