<?xml version='1.0' encoding="UTF-8" ?>

<sect1 id='gimp-tool-histogram'>
  <title lang="en">Histogram</title>
  <title lang="de">Histogramm</title>
  <title lang="fr">Histogramme</title>
  <indexterm>
    <primary lang="en">Toolbox</primary>
    <primary lang="de">Werkzeugfenster</primary>
    <primary lang="fr">Bo&icirc;te &agrave; Outils</primary>
    <secondary lang="en">Histogram</secondary>
    <secondary lang="de">Histogramm</secondary>
    <secondary lang="fr">Histogramme</secondary>
  </indexterm>
  
  <mediaobject lang="en">
    <imageobject>
      <imagedata fileref='../images/toolbox/toolbox-histogram.png' format='png'/>
    </imageobject>
  </mediaobject>

  <mediaobject lang="de">
    <imageobject>
      <imagedata fileref='../images/toolbox/de/toolbox-histogram.png' format='png'/>
    </imageobject>
  </mediaobject>
  
  <para lang="en">
    The Histogram tool is designed to provide you with detailed information
    about the image value structure.
  </para>
  <para lang="de">
    Das Histogramm gibt Auskunft &uuml;ber statistische
    Werte der aktuellen Ebene.
  </para>
  <para lang="fr">
    L'outil Histogramme vous donne des informations d&eacute;taill&eacute;es 
    sur la structure des valeurs de l'image.
  </para>
  
  <variablelist>
    <title lang="en">Histogram Dialog</title>
    <title lang="de">Histogramm Dialog</title>
    <title lang="fr">Bo&icirc;te de dialogue Histogramme</title>
    <varlistentry>
      <term lang="en">Overview</term>
      <term lang="de">Aufruf</term>
      <term lang="fr">Vue d'ensemble</term>
      <listitem>
        <para lang="en">
          When you click on the image with the Histogram tool, a dialog will be
          displayed showing detailed information about the way your image is
          structured by value.
        </para>
        <para lang="de">
          Das Informationsfenster des Histogramms wird aufgerufen, indem
          man in das Bild hineinklickt.  Im Fenster l&auml;sst sich
          dann das erstellte Histogramm des Bildes ablesen.
        </para>
        <para lang="fr">
          Quand vous cliquez sur l'image avec l'outil Histogramme, une bo&icirc;te de 
          dialogue s'ouvre vous donnant des informations d&eacute;taill&eacute;es sur 
          la fa&ccedil;on dont votre image est structur&eacute;e par valeur.
        </para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term lang="en">Information on Channel</term>
      <term lang="de">Information &uuml;ber Kanal</term>
      <term lang="fr">Information sur le canal</term>
      <listitem>
        <para lang="en">
          The dropdown list will allow you to select the color channel or alpha
          channel that you wish to have the information displayed for.
        </para>
        <para lang="en">
          Value is a composite channel containing the information for all
          channels. Red, Green, and Blue are channels that relate directly to
          the color component of the named color. Alpha shows the information
          regarding the alpha channel of the image. For further information on
          channels, see the glossary entry
          <link linkend='glossary-channels'>Channels</link>.
          For further information regarding Alpha, see the glossary entry
          <link linkend='glossary-alpha'>Alpha</link>.
        </para>
        <para lang="de">
          Die Dropdown Liste erlaubt es die Datenherkunft nochmals zu
          separieren. So stehen der Wert des Bildes, alle Farbkan&auml;le
          und der Alpha-Kanal zur Auswahl.
        </para>
        <para lang="en">
          Alle Kan&auml;le sind im Wert zusammengefasst. Die Kan&auml;le
          Rot, Gr&uuml;n und Blau lassen sich jeweils seperat im Histogramm
          abbilden und korrespondieren mit Ihren Farben. Der Alpha Kanal
          bildet nur Alpha Werte des bildes im Histogramm ab. Weitere
          Informationen &uuml;ber die <link
            linkend='glossary-channels'>Kan&auml;le</link> und des <link
            linkend='glossary-alpha'>Alpha</link> Wertes, findet man im
          Glossar.
        </para>
        <para lang="fr">
          La liste d&eacute;roulante vous permet de s&eacute;lectionner le 
          canal de couleur ou le canal alpha sur lequel vous voulez avoir 
          des informations.
        </para>
        <para lang="fr">
          Valeur est un canal composite contenant l'information sur tous les 
          canaux. Rouge, Vert et Bleu sont les canaux se r&eacute;f&egrave;rant 
          &agrave; chacune de ces couleurs. Alpha se r&eacute;f&egrave;re au 
          canal Alpha de l'image. Voyez le Glossaire &agrave; la rubrique 
          <link linkend='glossary-channels'>Canaux</link> et
          <link linkend='glossary-alpha'>Alpha</link>.
        </para> 
      </listitem>
    </varlistentry>
    <varlistentry>
      <term lang="en">Intensity Range</term>
      <term lang="de">Intensit&auml;tsbereich</term>
      <term lang="fr">Intervalle d'intensit&eacute;</term>
      <listitem lang="en">
        <para>
          The two spinboxes allow manual control of the range currently under
          scrutiny. The left spinbox indicates the left or start value and the
          right spinbox indicates the right or end value.
        </para>
        <para>
          You can select a range using the mouse by clicking and dragging
          within the visual histogram representation.
        </para>
      </listitem>
      <listitem lang="de">
        <para>
          Die 2 Spinboxen erlauben die manuelle Einschr&auml;nkung des
          Wertebereiches jeweils von 0 bis 255. Dabei repr&auml;sentiert die linke
          Spinbox den Startwert und die rechte Spinbox den Endwert des
          Histogrammes.
        </para>
        <para>
          Die Grenzen des Wertebereichs k&ouml;nnen ausserdem mit der Maus
          durch Ausw&auml;hlen des Bereiches in der
          Histogrammrepr&auml;sentation, festgelegt werden.
        </para>
      </listitem>
      <listitem lang="fr">
        <para>
          Les deux bo&icirc;tes de saisie permettent un contr&ocirc;le manuel de l'intervalle 
          &eacute;tudi&eacute;. Le gauche indique la valeur de gauche ou de 
          d&eacute;part. Le droit indique la valeur de droite ou d'arriv&eacute;e.
        </para>
        <para>
          Vous pouvez choisir un intervalle avec la souris en cliquant et en faisant 
          glisser le curseur dans la repr&eacute;sentation de l'histogramme.
        </para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term lang="en">Histogram Scale</term>
      <term lang="de">Skaleneinteilung</term>
      <term lang="fr">Echelle de l'Histogramme</term>
      <listitem>
        <para lang="en">
          FIXME
        </para>
        <para lang="de">
          Die Einteilung der Skala kann entweder logarithmisch oder linear
          erfolgen. Auswirkung hat dies, in den Abst&auml;nden der Unterteilung zwischen
          den Werten. Bei der linearen Skaleneinteilung entspricht der
          Abstand zweier Werte einem linearen Abstand, beispielsweise
          1,2,3,...,n. Im Gegensatz hat die logarithmische Darstellung zwar
          den gleichen Abstand zweier Werte, jedoch entspricht dies meist
          Zehnerpotenzen (zum Beispiel: 1, 10, 100, 1000, ...).
        </para>
        <para lang="fr">
          Les graduations de l'&eacute;chelle sont de deux types: un type 
          lin&eacute;aire (1,2,3...) ou un type logarithmique (1, 10, 100, 1000...)
        </para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term lang="en">Mean</term>
      <term lang="de">Durchschnitt</term>
      <term lang="fr">Moyenne</term>
      <listitem>
        <para lang="en">
          This number represents the mean value of the currently selected range
          of values.
        </para>
        <para lang="de">
          Dieser Wert repr&auml;sentiert den arithmetischen Durchschnitt
          des ausgew&auml;hlten Bereiches.
        </para>
        <para lang="fr">
          Ce nombre repr&eacute;sente la moyenne arithm&eacute;tique de l'intervalle 
          de valeur choisi.
        </para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term lang="en">Std Dev</term>
      <term lang="de">Std.-Abweichung</term>
      <term lang="fr">D&eacute;v Std</term>
      <listitem>
        <para lang="en">
          This number represents the standard deviation of the currently
          selected range of values.
        </para>
        <para lang="de">
          Dieser Wert repr&auml;sentiert die Standardabweichung des
          ausgew&auml;hlten Bereiches.
        </para>
        <para lang="fr">
          Ce nombre repr&eacute;sente la d&eacute;viation standard de l'intervalle  
          de valeur s&eacute;lectionn&eacute;.
        </para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term lang="en">Median</term>
      <term lang="de">Median</term>
      <term lang="fr">M&eacute;diane</term>
      <listitem>
        <para lang="en">
          This number represents the median value of the currently selected
          range of values.
        </para>
        <para lang="de">
          Der Median wird durch diesen Wert repr&auml;sentiert.
        </para>
        <para lang="fr">
          Ce nombre repr&eacute;sente la valeur m&eacute;diane de l'intervalle 
          de valeurs s&eacute;lectionn&eacute;.
        </para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term lang="en">Pixels</term>
      <term lang="de">Pixel</term>
      <term lang="fr">Pixels</term>
      <listitem>
        <para lang="en">
          This number represents the total number of pixels in the image.
        </para>
        <para lang="de">
          Die gesamte Anzahl der Pixel im aktuellen Bild.
        </para>
        <para lang="fr">
          Ce nombre repr&eacute;sente le nombre total de pixels dans l'image 
          actuelle.
        </para>        
      </listitem>
    </varlistentry>
    <varlistentry>
      <term lang="en">Count</term>
      <term lang="de">Anzahl</term>
      <term lang="fr">Compte</term>
      <listitem>
        <para lang="en">
          This number indicates the number of pixels in the current range.
        </para>
        <para lang="de">
          Die Anzahl der Pixel im aktuellen Bild
        </para><!-- XXX Unterschied zu Pixel? -->
        <para lang="fr">
          Ce nombre indique le nombre de pixels dans l'intervalle consid&eacute;r&eacute;.
        </para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term lang="en">Percentile</term>
      <term lang="de">Prozentsatz</term>
      <term lang="fr">Pourcentage</term>
      <listitem>
        <para lang="en">
          This figure represents the percentage of the total number of pixels
          that are currently in range.
        </para>
        <para lang="de">
          Die Anzahl der Pixel in Prozent, die
          aktuell im Histogramm ausgew&auml;hlt sind.
        </para>
        <para lang="fr">
          Pourcentage du total des pixels qui sont actuellement dans l'intervalle.
        </para>
      </listitem>
    </varlistentry>
  </variablelist>
</sect1>
